/******************************************************************************/
/*                                                                            */
/* src/libmvfs/Fd.h                                                           */
/*                                                                 2019/09/11 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef FD_H
#define FD_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdbool.h>
#include <stdint.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/** ファイルディスクリプタ情報 */
typedef struct {
    bool     used;      /**< 使用済みフラグ     */
    uint32_t localFd;   /**< ローカルFD         */
    uint32_t globalFd;  /**< グローバルFD       */
    uint64_t writeIdx;  /**< 書込みインデックス */
    uint64_t readIdx;   /**< 読込みインデックス */
} FdInfo_t;


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/* FD割当 */
extern FdInfo_t *FdAlloc( void );
/* FD解放 */
extern void FdFree( FdInfo_t *pFdInfo );
/* グローバルFD取得 */
extern FdInfo_t *FdGetGlobalFdInfo( uint32_t globalFd );
/* ローカルFD取得 */
extern FdInfo_t *FdGetLocalFdInfo( uint32_t localFd );


/******************************************************************************/
#endif

