/******************************************************************************/
/*                                                                            */
/* src/mvfs/Select.h                                                          */
/*                                                                 2019/09/16 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef SELECT_H
#define SELECT_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* カーネルヘッダ */
#include <kernel/types.h>


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/* Select機能初期化 */
extern void SelectInit( void );
/* Select要求メッセージ受信 */
extern void SelectRcvMsgSelectReq( MkTaskId_t taskId,
                                   void       *pBuffer );
/* VfsReady通知メッセージ受信 */
extern void SelectRcvMsgVfsReadyNtc( MkTaskId_t taskId,
                                     void       *pBuffer );


/******************************************************************************/
#endif
