/******************************************************************************/
/*                                                                            */
/* src/mvfs/include/Fd.h                                                      */
/*                                                                 2019/10/01 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef FD_H
#define FD_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdbool.h>
#include <stdint.h>

/* カーネルヘッダ */
#include <kernel/types.h>

/* ライブラリヘッダ */
#include <MLib/MLibState.h>

/* 外部モジュールヘッダ */
#include <Node.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/** ファイルディスクリプタ情報 */
typedef struct {
    bool              used;     /**< 使用済みフラグ   */
    uint32_t          globalFd; /**< グローバルFD     */
    uint32_t          localFd;  /**< ローカルFD       */
    MkTaskId_t        taskId;   /**< タスクID         */
    NodeInfo_t        *pNode;   /**< ノード           */
    MLibStateHandle_t stateHdl; /**< 状態遷移ハンドル */
} FdInfo_t;


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/* FD割当 */
extern FdInfo_t *FdAlloc( uint32_t   localFd,
                          NodeInfo_t *pNode   );
/* FD解放 */
extern void FdFree( uint32_t globalFd );
/* FD情報取得 */
extern FdInfo_t *FdGet( uint32_t globalFd );
/* FD管理初期化 */
extern void FdInit( void );


/******************************************************************************/
#endif
